---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCAggregate.Item(System.Int32)
source: html/0b18faca-ddb3-1013-06ed-b2055b58c33c.htm
---
# Autodesk.Revit.DB.IFC.IFCAggregate.Item Property

Get the IFCData for this aggregate.

## Syntax (C#)
```csharp
public IFCData this[
	int index
] { get; }
```

## Parameters
- **index** (`System.Int32`) - The index.

## Returns
The IFCData.